using System.Collections.Generic;
using Microsoft.Xna.Framework;
using Microsoft.Xna.Framework.Content;
using Mouse.ScreenSystem;

namespace Mouse.Screens
{


    ///=====================================================================================
    ///
    /// <summary>
    /// Главный экран меню это первое, что отображается, когда игра запускается.
    /// </summary>
    /// 
    ///--------------------------------------------------------------------------------------
    public class AOptionsMenuScreen : AMenuScreen
    {
        ///-------------------------------------------------------------------------------------
        private AOptions m_options = null;

        ///-------------------------------------------------------------------------------------




         ///=====================================================================================
        ///
        /// <summary>
        /// Меню с настройками
        /// </summary>
        /// 
        ///-------------------------------------------------------------------------------------
        public AOptionsMenuScreen()
            : base("Settings")
        {
        }
        ///-------------------------------------------------------------------------------------





         ///=====================================================================================
        ///
        /// <summary>
        /// Заголовок окна, используется в меню
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public override string getCaption()
        {
            return "Settings";
        }
        ///--------------------------------------------------------------------------------------







         ///=====================================================================================
        ///
        /// <summary>
        /// Также показывается что обрабатывает экран
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public override EScreenContent getTypeContent()
        {
            return EScreenContent.Options;
        }
        ///--------------------------------------------------------------------------------------










         ///=====================================================================================
        ///
        /// <summary>
        /// При выходе из главного меню, выходим из игры ваще.
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        protected override void onCancel()
        {
            exitScreen();
        }
        ///--------------------------------------------------------------------------------------







         ///=====================================================================================
        ///
        /// <summary>
        /// Загрузка меню с опциями
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        protected override void onLoadContent(ContentManager content)
        {
            base.onLoadContent(content);
            m_options = screenManager.options;


            
            /* добавим пункты меню
             */
            items.addItem(new AAccelerationScreen());

            AItem_checkbox e = null;
            e = items.addItemCheckbox("Vibration", m_options.vibrationEnabled);
            e.checkedEvent += checkboxVibration;

            e = items.addItemCheckbox("Music", m_options.musicEnabled);
            e.checkedEvent += checkboxMusic;

            /*
            e = items.addItemCheckbox("Sound", m_options.soundEnabled);
            e.checkedEvent += checkboxSound;
            */
              
            items.addItemExitMenu("back");
            items.loadContent(content);
        }
        ///--------------------------------------------------------------------------------------







         ///=====================================================================================
        ///
        /// <summary>
        /// Выгрузка игрового контента
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        protected override void onUnloadContent()
        {
            items.clear();
            base.onUnloadContent();
        }
        ///--------------------------------------------------------------------------------------






         ///=====================================================================================
        ///
        /// <summary>
        /// выбор пункта меню, вибрация
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public void checkboxVibration(AMenuScreen menu, AMenuEntry item, bool value)
        {
            m_options.vibrationEnabled = value;       
        }
        ///--------------------------------------------------------------------------------------





 
         ///=====================================================================================
        ///
        /// <summary>
        /// выбор пункта меню, фоновая музыка
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public void checkboxMusic(AMenuScreen menu, AMenuEntry item, bool value)
        {
            m_options.musicEnabled = value;
        }
        ///--------------------------------------------------------------------------------------






         ///=====================================================================================
        ///
        /// <summary>
        /// выбор пункта меню, звуковые эффекты
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public void checkboxSound(AMenuScreen menu, AMenuEntry item, bool value)
        {
            m_options.soundEnabled = value;
        }
        ///--------------------------------------------------------------------------------------









    }//AOptionsScreen
}