using System;
using System.Windows.Media;
using Microsoft.Xna.Framework;
using Microsoft.Xna.Framework.Media;
using Microsoft.Phone.Tasks;

namespace Mouse.ScreenSystem
{
    ///--------------------------------------------------------------------------------------






     ///=====================================================================================
    ///
    /// <summary>
    /// Фоновая музыка
    /// </summary>
    /// 
    ///--------------------------------------------------------------------------------------
    public class AMusic
    {
        ///--------------------------------------------------------------------------------------
        private bool m_enabledMusic = false; //включена выключена музыка
        private Song m_currentSong = null; //текущая музыка которая играет
        ///--------------------------------------------------------------------------------------






        
         ///=====================================================================================
        ///
        /// <summary>
        /// Установка музыки по умолчанию
        /// если на фоне ничего не играет, то галка поумолчанию будет вклчена
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public void setDefault()
        {
            m_enabledMusic = MediaPlayer.State != MediaState.Playing;
        }
        ///--------------------------------------------------------------------------------------






         ///=====================================================================================
        ///
        /// <summary>
        /// Включенна выключена фоновая музыка
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public bool enabled
        {
            get
            {
                return m_enabledMusic;
            }
            set
            {
                m_enabledMusic = value;
                if (m_enabledMusic)
                {
                    if (MediaPlayer.State != MediaState.Playing)
                    {
                        play();
                    }
                }
                else
                {
                    if (MediaPlayer.State != MediaState.Stopped)
                    {
                        MediaPlayer.Stop();
                    }
                }
            }
        }
        ///--------------------------------------------------------------------------------------






         ///=====================================================================================
        ///
        /// <summary>
        /// Проигрывание музыки
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public void playRepeat(Song song)
        {
            if (m_enabledMusic && m_currentSong != song)
            {
                m_currentSong = song;
                play();
            }
            else
            {
                m_currentSong = song;
            }

        }
        ///--------------------------------------------------------------------------------------








        ///=====================================================================================
        ///
        /// <summary>
        /// Проигрывание музыки
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public void play()
        {
           if (m_currentSong != null)
           {
                try
                {
                    MediaPlayer.IsRepeating = true;
                    MediaPlayer.IsVisualizationEnabled = false;
                    MediaPlayer.Play(m_currentSong);
                }
                catch
                {
                    m_currentSong = null;
                }
            }
        }
        ///--------------------------------------------------------------------------------------






         ///=====================================================================================
        ///
        /// <summary>
        /// Установка музыки на паузу
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public void pause()
        {
            if (m_enabledMusic)
            {
                if (MediaPlayer.State == MediaState.Playing)
                {
                    MediaPlayer.Pause();
                }
            }
        }
        ///--------------------------------------------------------------------------------------






         ///=====================================================================================
        ///
        /// <summary>
        /// Снимаем музуку с паузы
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public void resume()
        {
            if (m_enabledMusic)
            {
                if (MediaPlayer.State != MediaState.Playing)
                {
                    MediaPlayer.Resume();
                }
            }
        }
        ///--------------------------------------------------------------------------------------




    }
}
