using System;
using System.Collections.Generic;
using Microsoft.Xna.Framework;
using Microsoft.Xna.Framework.Graphics;
using Microsoft.Xna.Framework.Content;
using Mouse.GameProgramms.Map;
using Mouse.Particle;
using Mouse.ScreenSystem;

namespace Mouse.GameProgramms.GameObjects
{



     ///=====================================================================================
    ///
    /// <summary>
    /// Базовый класс с игровыми объектами
    /// </summary>
    /// 
    ///--------------------------------------------------------------------------------------
    public class AObject
    {

        /// <summary>
        /// Карта, на которой находится объект
        /// </summary>
        private AMap m_map = null;


        /// <summary>
        /// Начальная позиция объекта, позиция указывается вцентре объекта
        /// </summary>
        private Vector2 m_position = new Vector2(-1, -1);


        /// <summary>
        /// размер объекта
        /// </summary>
        private Vector2 m_size = new Vector2();



        /// <summary>
        /// признак, загружен контент юнита или нет
        /// </summary>
        private bool m_loadContent = false;
        

        

        /// <summary>
        /// эффект частиц
        /// </summary>
        private AParticleEffect m_effect = null;



        /// <summary>
        /// Признак активности объекта
        /// </summary>
        private bool m_active = true;



        /// <summary>
        /// Время задержки не активности 
        /// </summary>
        private TimeSpan m_suspendTime = TimeSpan.Zero;
        ///--------------------------------------------------------------------------------------







         ///=====================================================================================
        ///
        /// <summary>
        /// Конструктор объекта базового
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public AObject()
        {
        }
        ///--------------------------------------------------------------------------------------







        
         ///=====================================================================================
        ///
        /// <summary>
        /// Конструктор объекта базового, идет привязка карты
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public AObject(AMap mainMap)
        {
            map = mainMap;
        }
        ///--------------------------------------------------------------------------------------








         ///=====================================================================================
        ///
        /// <summary>
        /// Свойство привязанная карта
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public AMap map
        {
            get { return m_map; }
            set 
            {
                if (m_map != value)
                {
                    if (m_map != null)
                    {
                        AMap olds_map = m_map;
                        m_map = null;
                        olds_map.removeObject(this);
                    }
                    m_map = value;
                    if (m_map != null)
                    {
                        m_map.addObject(this);
                    }
                    m_position.X = -1;
                    m_position.Y = -1;
                }
            }
        }
        ///--------------------------------------------------------------------------------------







         ///=====================================================================================
        ///
        /// <summary>
        /// Позиция объекта, указывается в центре объекта
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public Vector2 position
        {
            get 
            { 
                return m_position; 
            }
            set
            {
                m_position = value;
            }
        }
        ///--------------------------------------------------------------------------------------






         ///=====================================================================================
        ///
        /// <summary>
        /// Проверка, можно или нет поставить новые координаты
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public virtual bool onCheckPosition(Vector2 pos)
        {
            return true;
        }
        ///--------------------------------------------------------------------------------------





         ///=====================================================================================
        ///
        /// <summary>
        /// Проверка, объект поставлен на позицию или нет
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public bool isPosition()
        {
            return (m_position == new Vector2(-1,-1)) ? false : true;
        }
        ///--------------------------------------------------------------------------------------






         ///=====================================================================================
        ///
        /// <summary>
        /// размер объекта
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public Vector2 size
        {
            get { return m_size; }
            set
            {
                m_size = value;
            }
        }
        ///--------------------------------------------------------------------------------------








         ///=====================================================================================
        ///
        /// <summary>
        /// Отрисовка объекта
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public virtual void onDraw(TimeSpan gameTime, ASpriteBatch spriteBatch)
        {
        }
        ///--------------------------------------------------------------------------------------





         ///=====================================================================================
        ///
        /// <summary>
        /// Пред отрисовка объекта
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public virtual void onBeforeDraw(TimeSpan gameTime, ASpriteBatch spriteBatch)
        {
        }
        ///--------------------------------------------------------------------------------------






         ///=====================================================================================
        ///
        /// <summary>
        /// Пост отрисовка объекта
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public virtual void onAfterDraw(TimeSpan gameTime, ASpriteBatch spriteBatch)
        {
        }
        ///--------------------------------------------------------------------------------------








         ///=====================================================================================
        ///
        /// <summary>
        /// Проверка на коллизию, и возвращение списка объектов которые находятся в пределах объекта
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public int getCollizion(List<AObject> objects)
        {
            int count = 0;
            if (m_map != null)
            {
                objects = m_map.getObjects(this);
                count = objects.Count;
            }
            return count;
        }
        ///--------------------------------------------------------------------------------------







         ///=====================================================================================
        ///
        /// <summary>
        /// Загрузка контента объекта, идет проверка на флаг, что контент уже был когдато загружен
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public void loadContent(ContentManager content)
        {
            if (!m_loadContent)
            {
                onLoadContent(content);
                m_loadContent = true;
            }
        }
        ///--------------------------------------------------------------------------------------








         ///=====================================================================================
        ///
        /// <summary>
        /// Загрузка контента всех потомков
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        protected virtual void onLoadContent(ContentManager content)
        {
        }
        ///--------------------------------------------------------------------------------------






 
         ///=====================================================================================
        ///
        /// <summary>
        /// Обновление внутренней логики объекта
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public virtual void onUpdate(TimeSpan gameTime)
        {
            /*
             * обрабатываем активность
             * смотрим время и переводим его в активное состояние
            */
            if (!m_active && m_suspendTime != TimeSpan.Zero)
            {
                m_suspendTime -= gameTime;
                if (m_suspendTime.TotalMilliseconds < 0)
                {
                    m_active = true;
                    m_suspendTime = TimeSpan.Zero;
                }
            }



            /* обработка эффектов
             * 
             */
            if (m_effect != null && isPosition())
            {
                if (!m_effect.onCreation(gameTime, m_position, m_size))
                {
                    m_effect = null;//удалим эффект
                }
            }
        }
        ///--------------------------------------------------------------------------------------







         ///=====================================================================================
        ///
        /// <summary>
        /// установка эффекта
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public AParticleEffect effect
        {
            get
            {
                return m_effect;
            }
            set
            {
                m_effect = value;
            }
        }
        ///--------------------------------------------------------------------------------------






         ///=====================================================================================
        ///
        /// <summary>
        /// Возвращаем, активный объект или нет
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public bool active
        {
            get
            {
                return m_active;
            }
            set
            {
                m_active = value;
                m_suspendTime = TimeSpan.Zero;
            }
        }
        ///--------------------------------------------------------------------------------------






         ///=====================================================================================
        ///
        /// <summary>
        /// Переводим в временно в неактивное состояние
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public void suspendActive(TimeSpan time)
        {
            m_active = false;
            m_suspendTime = time;
        }
        ///--------------------------------------------------------------------------------------





         ///=====================================================================================
        ///
        /// <summary>
        /// Возвращаем текущее неактивное время
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public TimeSpan suspendTime
        {
            get
            {
                return m_suspendTime;
            }
        }
        ///--------------------------------------------------------------------------------------







         ///=====================================================================================
        ///
        /// <summary>
        /// Переводим в временно в неактивное состояние
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public void suspendActive()
        {
            suspendActive(TimeSpan.FromSeconds(2.0));
        }
        ///--------------------------------------------------------------------------------------


    
    } //AObjects
}
