using System;
using Microsoft.Xna.Framework;
using Microsoft.Xna.Framework.Content;
using Microsoft.Xna.Framework.Graphics;

using Mouse.ScreenSystem;

namespace Mouse.Particle
{
    ///--------------------------------------------------------------------------------------



    /*
        public static readonly int none = 0;
        public static readonly int effectTrail = 1;
        public static readonly int effectHeartHP = 2;
        public static readonly int effectHeartLife = 3;
        
       4;//AEffectBoom  = 4
    */




    ///=====================================================================================
    ///
    /// <summary>
    /// Группа частиц, которые образуют один эффект
    /// Эффект также запускает на исполнение частицу.и координирует ее работу
    /// 
    /// Класс состоит из двух блоков. 
    /// 1 блок для внедрения в объект, управляет созданием группы частиц
    /// 2 блок внедряется в менеджер частиц, управляет всеми группами
    /// </summary>
    /// 
    ///--------------------------------------------------------------------------------------
    public abstract class AParticleEffect
    {
        ///--------------------------------------------------------------------------------------
        protected AParticleManager  particleManager = null;
        ///--------------------------------------------------------------------------------------

 



         ///=====================================================================================
        ///
        /// <summary>
        /// constructor 1
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public AParticleEffect(AParticleManager manager)
        {
            particleManager = manager;
        }
        ///--------------------------------------------------------------------------------------








         ///=====================================================================================
        ///
        /// <summary>
        /// Создание новой частицы  и привязка ее к эффекту
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public AParticle newParticle()
        {
            AParticle obj = particleManager.newParticle();
            obj.typeEffect = type();
            return obj;
        }
        ///--------------------------------------------------------------------------------------







         ///=====================================================================================
        ///
        /// <summary>
        /// Удаление частицы на уровне контроллера
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public void removeParticle(AParticle obj)
        {
            obj.typeEffect = 0;//none
            particleManager.removeParticle(obj);
        }
        ///--------------------------------------------------------------------------------------








         ///=====================================================================================
        ///
        /// <summary>
        /// тип используемого эффекта
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public abstract int type();






         ///=====================================================================================
        ///
        /// <summary>
        /// Процесс создания эффекта
        /// возвращаем значение true - эффект еще создается
        /// false - эффект можно удалить
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public abstract bool onCreation(TimeSpan time, Vector2 position, Vector2 size);





         ///=====================================================================================
        ///
        /// <summary>
        /// выполнение эффекта для общей группы
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public abstract void onUpdate(TimeSpan gameTime);






         ///=====================================================================================
        ///
        /// <summary>
        /// выполнение эффекта для конкретного объекта
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public abstract void onUpdateParticle(TimeSpan gameTime, AParticle particle);





        
         ///=====================================================================================
        ///
        /// <summary>
        /// Отрисовка эффекта
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public abstract void onDrawParticle(TimeSpan gameTime, ASpriteBatch spriteBatch, AParticle particle);







         ///=====================================================================================
        ///
        /// <summary>
        /// Виртуальный метод загрузки графического контента эффекта
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public abstract void onLoadContent(ContentManager content);



    }//AParticleEffect
    //===========================================================================================







}
